# sudo apt install git - установка системы контроля версий(кода)

# git - система контроля версий - программа для управления версиями кода 

# github - сервис для хранения кода 

# репозиторий - папка с которой может взаимодействовать git 

# git init - превращает текущую директорию в git репозиторий
# git status - проверка статуса репозитория 
# git add, <file_name> / git add . - добавить файлы к отслеживанию изменений 
# git commit -m "комментарий версии" - сохранение версии / создание коммита
# git remote add <название переменной>(принято называть "origin") <ссылка-на-удаленные-репозитории> - соединение локального репощитория с удаленным
# git push <название переменной> <название ветки> - отправка версий на github
